Revit 2026 API

# ExternallyTaggedNonBRepsCanAddExternallyTaggedNonBRep Method

---

Checks if the input geometry could be added to this collection or not.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool CanAddExternallyTaggedNonBRep(
	ExternallyTaggedNonBRep geometry
)
```
```vb
Public Function CanAddExternallyTaggedNonBRep (
	geometry As ExternallyTaggedNonBRep
) As Boolean
```
```cpp
public:
bool CanAddExternallyTaggedNonBRep(
	ExternallyTaggedNonBRep^ geometry
)
```
```fsharp
member CanAddExternallyTaggedNonBRep :
        geometry : ExternallyTaggedNonBRep -> bool
```

#### Parameters

geometry ExternallyTaggedNonBRep

#### Return Value

Boolean True if we can add the input geometry to this collection, false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

Duplicate ExternalGeometryIds are prohibited.

#### Reference

ExternallyTaggedNonBReps Class

Autodesk.Revit.DB Namespace